apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash_mtd.c
static const struct esp32s3_mtd_dev_s g_esp32s3_spiflash_encrypt =
{
  .mtd =
          {
            .erase  = esp32s3_erase,
            .bread  = esp32s3_bread_decrypt,
            .bwrite = esp32s3_bwrite_encrypt,
            .read   = esp32s3_read_decrypt,
            .ioctl  = esp32s3_ioctl,
#ifdef CONFIG_MTD_BYTE_WRITE
            .write  = esp32s3_write_encrypt,
#endif
            .name   = "esp32s3_spiflash_encrypt"
          },
  .data = (esp_rom_spiflash_legacy_data_t **)
          (&rom_spiflash_legacy_data),
};

/* Ensure exclusive access to the driver */

static mutex_t g_lock = NXMUTEX_INITIALIZER;

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
static struct work_s g_work;
static mutex_t g_work_lock = NXMUTEX_INITIALIZER;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stack_is_psram
 *
 * Description:
 *   Check if current task's stack space is in PSRAM.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   true if it is in PSRAM or false if not.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
static inline bool IRAM_ATTR stack_is_psram(void)
{
  void *sp = (void *)up_getsp();

  return esp32s3_ptr_extram(sp);
}
#endif

/**
 * From: esp-idf/components/hal/esp32s3/include/hal/spi_flash_encrypted_ll.h
 */

/**
 * Choose type of chip you want to encrypt manully
 */

typedef enum
{
    FLASH_ENCRYPTION_MANU = 0, /* !< Manually encrypt the flash chip. */
    PSRAM_ENCRYPTION_MANU = 1  /* !< Manually encrypt the psram chip. */
} flash_encrypt_ll_type_t;

/**
 * Enable the flash encryption function under spi boot mode and download boot
 * mode.
 */

static inline void spi_flash_encrypt_ll_enable(void)
{
    REG_SET_BIT(SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG,
                SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT |
                SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT);
}

/**
 * Disable the flash encryption mode.
 */

static inline void spi_flash_encrypt_ll_disable(void)
{
    REG_CLR_BIT(SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG,
                SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT);
}

/**
 * Choose type of chip you want to encrypt manully
 *
 * @param type The type of chip to be encrypted
 *
 * @note The hardware currently support flash encryption.
 */

static inline void spi_flash_encrypt_ll_type(flash_encrypt_ll_type_t type)
{
    HAL_ASSERT(type == FLASH_ENCRYPTION_MANU); /* Our hardware only support flash encryption */
    REG_WRITE(AES_XTS_DESTINATION_REG, type);
}

/**
 * Configure the data size of a single encryption.
 *
 * @param block_size Size of the desired block.
 */

static inline void spi_flash_encrypt_ll_buffer_length(uint32_t size)
{
    REG_WRITE(AES_XTS_SIZE_REG, size >> 5); /* Desired block should not be larger than the block size. */
}

/**
 * Save 32-bit piece of plaintext.
 *
 * @param address the address of written flash partition.
 * @param buffer Buffer to store the input data.
 * @param size Buffer size.
 *
 */

static inline
void spi_flash_encrypt_ll_plaintext_save(uint32_t address,
                                         const uint32_t * buffer,
                                         uint32_t size)
{
    uint32_t plaintext_offs =
        (address % SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX);
    HAL_ASSERT(
        plaintext_offs + size <= SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX);
    memcpy((void *)(AES_XTS_PLAIN_BASE + plaintext_offs), buffer, size);
}

/**
 * Copy the flash address to XTS_AES physical address
 *
 * @param flash_addr flash address to write.
 */

static inline void spi_flash_encrypt_ll_address_save(uint32_t flash_addr)
{
    REG_WRITE(AES_XTS_PHYSICAL_ADDR_REG, flash_addr);
}

/**
 * Start flash encryption
 */

static inline void spi_flash_encrypt_ll_calculate_start(void)
{
    REG_WRITE(AES_XTS_TRIGGER_REG, 1);
}

/**
 * Wait for flash encryption termination
 */

static inline void spi_flash_encrypt_ll_calculate_wait_idle(void)
{
  while (REG_READ(AES_XTS_STATE_REG) == 0x1)
    {
    }
}

/**
 * Finish the flash encryption and make encrypted result accessible to SPI.
 */

static inline void spi_flash_encrypt_ll_done(void)
{
  REG_WRITE(AES_XTS_RELEASE_REG, 1);
  while (REG_READ(AES_XTS_STATE_REG) != 0x3)
    {
    }
}

/**
 * Set to destroy encrypted result
 */

static inline void spi_flash_encrypt_ll_destroy(void)
{
    REG_WRITE(AES_XTS_DESTROY_REG, 1);
}

/**
 * Check if is qualified to encrypt the buffer
 *
 * @param address the address of written flash partition.
 * @param length Buffer size.
 */

static inline bool spi_flash_encrypt_ll_check(uint32_t address,
                                              uint32_t length)
{
  return ((address % length) == 0) ? true : false;
}

/**
 * from: esp-idf/components/hal/spi_flash_encrypt_hal_iram.c
 */

void spi_flash_encryption_hal_enable(void)
{
    spi_flash_encrypt_ll_enable();
    spi_flash_encrypt_ll_type(FLASH_ENCRYPTION_MANU);
}

void spi_flash_encryption_hal_disable(void)
{
    spi_flash_encrypt_ll_disable();
}

void spi_flash_encryption_hal_prepare(uint32_t address,
                                      const uint32_t * buffer, uint32_t size)
{
    spi_flash_encrypt_ll_buffer_length(size);
    spi_flash_encrypt_ll_address_save(address);
    spi_flash_encrypt_ll_plaintext_save(address, buffer, size);
    spi_flash_encrypt_ll_calculate_start();
}

void spi_flash_encryption_hal_done(void)
{
    spi_flash_encrypt_ll_calculate_wait_idle();
    spi_flash_encrypt_ll_done();
}

void spi_flash_encryption_hal_destroy(void)
{
    spi_flash_encrypt_ll_destroy();
}

bool spi_flash_encryption_hal_check(uint32_t address, uint32_t length)
{
  return spi_flash_encrypt_ll_check(address, length);
}

/**
 * From: esp-idf/components/spi_flash/spi_flash_chip_generic.c
 */

/**
 * These are the pointer to HW flash encryption.
 * Default using hardware encryption.
 */

DRAM_ATTR static spi_flash_encryption_t esp_flash_encryption_default
    __attribute__((__unused__)) =
    {
    .flash_encryption_enable = spi_flash_encryption_hal_enable,
    .flash_encryption_disable = spi_flash_encryption_hal_disable,
    .flash_encryption_data_prepare = spi_flash_encryption_hal_prepare,
    .flash_encryption_done = spi_flash_encryption_hal_done,
    .flash_encryption_destroy = spi_flash_encryption_hal_destroy,
    .flash_encryption_check = spi_flash_encryption_hal_check,
    };

/**
 * Workaround of spi_flash_write_encrypted
 * by using of spi_flash_chip_generic_write_encrypted
 */

