apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash_mtd.c
int spi_flash_write_encrypted_manu(uint32_t address, const void *buffer,
                              uint32_t length)
{
  spi_flash_encryption_t *esp_flash_encryption =
                                             &esp_flash_encryption_default;
  esp_err_t err = ESP_OK;

  /* Check if the buffer and length can qualify the requirements */

  if (esp_flash_encryption->flash_encryption_check(address, length) != true)
    {
      return ESP_ERR_NOT_SUPPORTED;
    }

  const uint8_t *data_bytes = (const uint8_t *)buffer;
  esp_flash_encryption->flash_encryption_enable();
  while (length > 0)
    {
      int block_size;

      /* Write the largest block if possible */

      if (address % 64 == 0 && length >= 64)
        {
          block_size = 64;
        }
      else if (address % 32 == 0 && length >= 32)
        {
          block_size = 32;
        }
      else
        {
          block_size = 16;
        }

      /**
       * Prepare the flash chip (same time as AES operation, for performance)
       */

      esp_flash_encryption->flash_encryption_data_prepare(address,
                                                      (uint32_t *)data_bytes,
                                                      block_size);

      /* err = chip->chip_drv->set_chip_write_protect(chip, false); */

      if (err != ESP_OK)
        {
          return err;
        }

      /**
       * Waiting for encrypting buffer to finish and
       * making result visible for SPI1
       */

      esp_flash_encryption->flash_encryption_done();

      /**
       * Note: For encryption function, after write flash command is sent.
       * The hardware will write the encrypted buffer
       * prepared in XTS_FLASH_ENCRYPTION register
       * in function `flash_encryption_data_prepare`, instead of the origin
       * buffer named `data_bytes`.
       */

      /**
       * err = chip->chip_drv->write(chip, (uint32_t *)data_bytes,
       *                             address, length);
       */

      if (err != ESP_OK)
        {
          return err;
        }

      /**
       * err = chip->chip_drv->wait_idle(chip,
       *                      chip->chip_drv->timeout->page_program_timeout);
       */

      if (err != ESP_OK)
        {
          return err;
        }

      spi_flash_write(address, data_bytes, block_size);

      /**
       * Note: we don't wait for idle status here, because this way
       * the AES peripheral can start encrypting the next
       * block while the SPI flash chip is busy completing the write
       */

      esp_flash_encryption->flash_encryption_destroy();

      length -= block_size;
      data_bytes += block_size;
      address += block_size;
    }

  esp_flash_encryption->flash_encryption_disable();
  return err;
}

/****************************************************************************
 * Name: esp32s3_spiflash_work
 *
 * Description:
 *   Do SPI Flash operation, cache result and send semaphore to wake up
 *   blocked task.
 *
 * Input Parameters:
 *   arg - Reference to SPI flash work arguments structure (cast to void*)
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
static void esp32s3_spiflash_work(void *arg)
{
  struct spiflash_work_arg *work_arg = (struct spiflash_work_arg *)arg;

  if (work_arg->op_code == SPIFLASH_OP_CODE_WRITE)
    {
      work_arg->ret = spi_flash_write(work_arg->op_arg.addr,
                                      work_arg->op_arg.buffer,
                                      work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_READ)
    {
      work_arg->ret = spi_flash_read(work_arg->op_arg.addr,
                                     work_arg->op_arg.buffer,
                                     work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ERASE)
    {
      work_arg->ret = spi_flash_erase_range(work_arg->op_arg.addr,
                                            work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_SET_BANK)
    {
      work_arg->ret = cache_dbus_mmu_map(work_arg->op_arg.addr,
                                         work_arg->op_arg.paddr,
                                         work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ENCRYPT_READ)
    {
      work_arg->ret = spi_flash_read_encrypted(work_arg->op_arg.addr,
                                               work_arg->op_arg.buffer,
                                               work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ENCRYPT_WRITE)
    {
      work_arg->ret = spi_flash_write_encrypted_manu(work_arg->op_arg.addr,
                                                work_arg->op_arg.buffer,
                                                work_arg->op_arg.size);
    }
  else
    {
      ferr("ERROR: op_code=%d is not supported\n", work_arg->op_code);
    }

  nxsem_post(&work_arg->sem);
}

/****************************************************************************
 * Name: esp32s3_async_op
 *
 * Description:
 *   Send operation code and arguments to workqueue so that workqueue do SPI
 *   Flash operation actually.
 *
 * Input Parameters:
 *   opcode - SPI flash work operation code
 *   addr   - target address
 *   buffer - data buffer pointer
 *   size   - data number
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

static int esp32s3_async_op(enum spiflash_op_code_e opcode,
                            uint32_t addr,
                            const uint8_t *buffer,
                            uint32_t size,
                            uint32_t paddr)
{
  int ret;
  struct spiflash_work_arg work_arg =
  {
    .op_code = opcode,
    .op_arg =
    {
      .addr = addr,
      .buffer = (uint8_t *)buffer,
      .size = size,
      .paddr = paddr,
    },
    .sem = NXSEM_INITIALIZER(0, 0)
  };

  ret = nxmutex_lock(&g_work_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = work_queue(LPWORK, &g_work, esp32s3_spiflash_work, &work_arg, 0);
  if (ret == 0)
    {
      nxsem_wait(&work_arg.sem);
      ret = work_arg.ret;
    }

  nxmutex_unlock(&g_work_lock);

  return ret;
}
#endif

/****************************************************************************
 * Name: esp32s3_erase
 *
 * Description:
 *   Erase SPI Flash designated sectors.
 *
 * Input Parameters:
 *   dev        - MTD device data
 *   startblock - start block number, it is not equal to SPI Flash's block
 *   nblocks    - Number of blocks
 *
 * Returned Value:
 *   Erased blocks if success or a negative value if fail.
 *
 ****************************************************************************/

static int esp32s3_erase(struct mtd_dev_s *dev, off_t startblock,
                         size_t nblocks)
{
  ssize_t ret;
  uint32_t offset = startblock * MTD_ERASE_SIZE;
  uint32_t nbytes = nblocks * MTD_ERASE_SIZE;
  struct esp32s3_mtd_dev_s *priv = (struct esp32s3_mtd_dev_s *)dev;

  if ((offset > MTD_SIZE(priv)) || ((offset + nbytes) > MTD_SIZE(priv)))
    {
      return -EINVAL;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu)\n", __func__, dev, startblock, nblocks);

  finfo("spi_flash_erase_range(0x%x, %d)\n", offset, nbytes);
#endif

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
  if (stack_is_psram())
    {
      ret = esp32s3_async_op(SPIFLASH_OP_CODE_ERASE, offset, NULL,
                             nbytes, 0);
    }
  else
#endif
    {
      ret = spi_flash_erase_range(offset, nbytes);
    }

  nxmutex_unlock(&g_lock);
  if (ret == OK)
    {
      ret = nblocks;
    }
  else
    {
#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
      finfo("Failed to erase the flash range!\n");
#endif
      ret = -1;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_read
 *
 * Description:
 *   Read data from SPI Flash at designated address.
 *
 * Input Parameters:
 *   dev    - MTD device data
 *   offset - target address offset
 *   nbytes - data number
 *   buffer - data buffer pointer
 *
 * Returned Value:
 *   Read data bytes if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_read(struct mtd_dev_s *dev, off_t offset,
                          size_t nbytes, uint8_t *buffer)
{
  ssize_t ret;

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n",
        __func__, dev, offset, nbytes, buffer);

  finfo("spi_flash_read(0x%" PRIxOFF ", %p, %zu)\n", offset, buffer, nbytes);
#endif

  /* Acquire the mutex. */

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
  if (stack_is_psram())
    {
      ret = esp32s3_async_op(SPIFLASH_OP_CODE_READ, offset,
                             buffer, nbytes, 0);
    }
  else
#endif
    {
      ret = spi_flash_read(offset, buffer, nbytes);
    }

  nxmutex_unlock(&g_lock);
  if (ret == OK)
    {
      ret = nbytes;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_bread
 *
 * Description:
 *   Read data from designated blocks.
 *
 * Input Parameters:
 *   dev        - MTD device data
 *   startblock - start block number, it is not equal to SPI Flash's block
 *   nblocks    - blocks number
 *   buffer     - data buffer pointer
 *
 * Returned Value:
 *   Read block number if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_bread(struct mtd_dev_s *dev, off_t startblock,
                           size_t nblocks, uint8_t *buffer)
{
  ssize_t ret;
  uint32_t addr = startblock * MTD_BLK_SIZE;
  uint32_t size = nblocks * MTD_BLK_SIZE;

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n",
        __func__, dev, startblock, nblocks, buffer);
#endif

  ret = esp32s3_read(dev, addr, size, buffer);
  if (ret == size)
    {
      ret = nblocks;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_read_decrypt
 *
 * Description:
 *   Read encrypted data and decrypt automatically from SPI Flash
 *   at designated address.
 *
 * Input Parameters:
 *   dev    - MTD device data
 *   offset - target address offset
 *   nbytes - data number
 *   buffer - data buffer pointer
 *
 * Returned Value:
 *   Read data bytes if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_read_decrypt(struct mtd_dev_s *dev,
                                  off_t offset,
                                  size_t nbytes,
                                  uint8_t *buffer)
{
  ssize_t ret;

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n",
        __func__, dev, offset, nbytes, buffer);

  finfo("spi_flash_read_encrypted(0x%" PRIxOFF ", %p, %zu)\n",
        offset, buffer, nbytes);
#endif

  /* Acquire the mutex. */

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
  if (stack_is_psram())
    {
      ret = esp32s3_async_op(SPIFLASH_OP_CODE_ENCRYPT_READ, offset,
                             buffer, nbytes, 0);
    }
  else
#endif
    {
      ret = spi_flash_read_encrypted(offset, buffer, nbytes);
    }

  nxmutex_unlock(&g_lock);
  if (ret == OK)
    {
      ret = nbytes;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_bread_decrypt
 *
 * Description:
 *   Read encrypted data and decrypt automatically from designated blocks.
 *
 * Input Parameters:
 *   dev        - MTD device data
 *   startblock - start block number, it is not equal to SPI Flash's block
 *   nblocks    - blocks number
 *   buffer     - data buffer pointer
 *
 * Returned Value:
 *   Read block number if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_bread_decrypt(struct mtd_dev_s *dev,
                                     off_t startblock,
                                     size_t nblocks,
                                     uint8_t *buffer)
{
  ssize_t ret;
  uint32_t addr = startblock * MTD_BLK_SIZE;
  uint32_t size = nblocks * MTD_BLK_SIZE;

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n",
        __func__, dev, startblock, nblocks, buffer);
#endif

  ret = esp32s3_read_decrypt(dev, addr, size, buffer);
  if (ret == size)
    {
      ret = nblocks;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif
  return ret;
}

/****************************************************************************
 * Name: esp32s3_writedata_encrypt
 *
 * Description:
 *   Write plaintext data to SPI Flash at designated address by SPI Flash
 *   hardware encryption, and written data in SPI Flash is ciphertext.
 *
 * Input Parameters:
 *   dev    - MTD device data
 *   offset - target address offset, must be 32Bytes-aligned
 *   size   - data number, must be 32Bytes-aligned
 *   buffer - data buffer pointer
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

static int esp32s3_writedata_encrypt(struct mtd_dev_s *dev, off_t offset,
                                     uint32_t size, const uint8_t *buffer)
{
  ssize_t ret;

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n", __func__, dev, offset,
        size, buffer);
#endif

  DEBUGASSERT((offset % SPI_FLASH_ENCRYPT_MIN_SIZE) == 0);
  DEBUGASSERT((size % SPI_FLASH_ENCRYPT_MIN_SIZE) == 0);
  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
  if (stack_is_psram())
    {
      ret = esp32s3_async_op(SPIFLASH_OP_CODE_ENCRYPT_WRITE, offset,
                             buffer, size, 0);
    }
  else
#endif
    {
      ret = spi_flash_write_encrypted_manu(offset, buffer, size);
    }

  nxmutex_unlock(&g_lock);
#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif
  return ret;
}

/****************************************************************************
 * Name: esp32s3_write_encrypt
 *
 * Description:
 *   Write data to SPI Flash at designated address by SPI Flash hardware
 *   encryption.
 *
 * Input Parameters:
 *   dev    - MTD device data
 *   offset - target address offset, must be 16Bytes-aligned
 *   nbytes - data number, must be 16Bytes-aligned
 *   buffer - data buffer pointer
 *
 * Returned Value:
 *   Writen bytes if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_write_encrypt(struct mtd_dev_s *dev, off_t offset,
                                     size_t nbytes, const uint8_t *buffer)
{
  ssize_t ret;
  size_t n;
  off_t addr;
  size_t wbytes;
  uint32_t step;
  uint8_t enc_buf[SPI_FLASH_ENCRYPT_UNIT_SIZE];

  if ((offset % SPI_FLASH_ENCRYPT_MIN_SIZE) ||
      (nbytes % SPI_FLASH_ENCRYPT_MIN_SIZE))
    {
      return -EINVAL;
    }
  else if (nbytes == 0)
    {
      return 0;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%x, %d, %p)\n", __func__, dev, offset, nbytes, buffer);
#endif

  for (n = 0; n < nbytes; n += step)
    {
      /* The temporary buffer need to be seperated into
       * 16-bytes, 32-bytes, 64-bytes(if supported).
       */

      addr = offset + n;
      if ((addr % 64) == 0 && (nbytes - n) >= 64)
        {
          wbytes = 64;
        }
      else if ((addr % 32) == 0 && (nbytes - n) >= 32)
        {
          wbytes = 32;
        }
      else
        {
          wbytes = 16;
        }

      memcpy(enc_buf, buffer + n, wbytes);
      step = wbytes;
      ret = esp32s3_writedata_encrypt(dev, addr, wbytes, enc_buf);
      if (ret < 0)
        {
          break;
        }
    }

  if (ret >= 0)
    {
      ret = nbytes;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("esp32s3_write_encrypt()=%d\n", ret);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_write
 *
 * Description:
 *   write data to SPI Flash at designated address.
 *
 * Input Parameters:
 *   dev    - MTD device data
 *   offset - target address offset
 *   nbytes - data number
 *   buffer - data buffer pointer
 *
 * Returned Value:
 *   Writen bytes if success or a negative value if fail.
 *
 ****************************************************************************/

static ssize_t esp32s3_write(struct mtd_dev_s *dev, off_t offset,
                             size_t nbytes, const uint8_t *buffer)
{
  ssize_t ret;
  struct esp32s3_mtd_dev_s *priv = (struct esp32s3_mtd_dev_s *)dev;

  ASSERT(buffer);

  if ((offset > MTD_SIZE(priv)) || ((offset + nbytes) > MTD_SIZE(priv)))
    {
      return -EINVAL;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s(%p, 0x%" PRIxOFF ", %zu, %p)\n",
        __func__, dev, offset, nbytes, buffer);

  finfo("spi_flash_write(0x%" PRIxOFF ", %p, %zu)\n",
        offset, buffer, nbytes);
#endif

  /* Acquire the mutex. */

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_ESP32S3_SPI_FLASH_SUPPORT_PSRAM_STACK
  if (stack_is_psram())
    {
      ret = esp32s3_async_op(SPIFLASH_OP_CODE_WRITE, offset,
                             buffer, nbytes, 0);
    }
  else
#endif
    {
      ret = spi_flash_write(offset, buffer, nbytes);
    }

  nxmutex_unlock(&g_lock);
  if (ret == OK)
    {
      ret = nbytes;
    }

#ifdef CONFIG_ESP32S3_STORAGE_MTD_DEBUG
  finfo("%s()=%d\n", __func__, ret);
#endif
  return ret;
}

/****************************************************************************
 * Name: esp32s3_bwrite_encrypt
 *
 * Description:
 *   Write data to designated blocks by SPI Flash hardware encryption.
 *
 * Input Parameters:
 *   dev        - MTD device data
 *   startblock - start MTD block number,
 *                it is not equal to SPI Flash's block
 *   nblocks    - blocks number
 *   buffer     - data buffer pointer
 *
 * Returned Value:
 *   Writen block number if success or a negative value if fail.
 *
 ****************************************************************************/

